{
  "name": "the-mechanism",
  "display": true,
  "positionTitle": "Senior Developer",
  "synopsis": "[*The Mechanism*](http://www.themechanism.com/) is a nimble design firm in NYC where I cut my teeth on professional development. Under the fantastic leadership of my boss and mentor, [Dave Fletcher](http://www.themechanism.com/about-us/), I worked on a variety of professional projects while substantiating my collegiate learning with real world experience.\n\nSome clients we worked for included the [*James Beard Foundation*](http://www.jamesbeard.org/), [*My Morning Jacket*](https://www.mymorningjacket.com/), and the [*Financial Access Initiative*](http://www.financialaccess.org/). See my project details below for more!",
  "logo": "mechanism.svg",
  "title": "The Mechanism",
  "subtitle": "Believe in Better",
  "body": "I oversaw two website redesigns at *The Mechanism*. In both cases I’ve been able to use the opportunity to experiment with new technologies and improve my skill set thanks to founder and bossman [Dave Fletcher](http://www.themechanism.com/about-us/). The first redesign saw us go from a static website to an adaptive one based on the Skeleton framework. Since learning of this grid framework it became my go to for its simplicity and flexibility. Though that version of the site served us well for over a year, we really wanted to push the envelope with this latest redesign while making the content management easier.\n\nThus began an internal project to create a beautiful new site driven off a fully featured content management system. I chose Wordpress since the complexity of Drupal seemed unnecessary. I’d also already begun sophisticated Wordpress development in my free time, including my own portfolio, so the process became a very symbiotic one, where a discovery in one would often inform the others.\n\nGiven a flat design for a client page and a color guide, I extrapolated the design for rest of the site using our existing site as reference for structure. Building off the Skeleton structure of the older iteration of the site, I created a colorful and adaptive site that better reflects the atmosphere and capabilities of *The Mechanism* as a design and development firm. The Wordpress back end, powered up with the Pods Framework, provides an intuitive content management system for the entire office leading to a more dynamic, and therefore more engaging, web experience.",
  "gallery": [
    {
      "img": "an-img.jpg",
      "caption": "A img 1 caption"
    },
    {
      "img": "an-img.jpg",
      "caption": "A img 2 caption"
    },
    {
      "img": "an-img.jpg",
      "caption": "A img 3 caption"
    }
  ]
}
